// 01 정수값 받기

//#include <stdio.h>
//int main()
//{
//	int n1, n2 = 0;
//	printf("정수 1 ,2입력 >>> ");
//	scanf_s("%d%d", &n1,&n2); // 값은 스페이스바 혹은 엔터키를 기준으로 다음값 확인
//	// scanf_s : 표준입력장치(보통 키보드)로부터 프로그램 방향으로 값을 받을 때 사용
//	// "%d" : 정수서식에 맞게 값을 받겠다.
//	// &(참조연산자,주소연산자) : 공간의 주소값을 반환 
//	// n1 : 변수명
//
//	printf("입력한 값 : %d %d\n", n1,n2);
//}

// 문제
// 정수 3개를 한번에 받아서 세수의 합 / 곱 / 차를 출력해 보세요.

//#include <stdio.h>
//int main()
//{
//	int n1 = 0;
//	int n2 = 0;
//	int n3 = 0;
//	printf("정수 3개 입력 : ");
//	scanf_s("%d%d%d", &n1, &n2, &n3);	
//	printf("합 : %d\n", n1 + n2 + n3);
//	printf("곱 : %d\n", n1 * n2 * n3);
//	printf("차 : %d\n", n1 - n2 - n3);
//
//	return 0;
//}

