#include <stdio.h>
// 문제 

// 1부터 10까지의 정수 중에서 짝수만 출력하는 프로그램을 작성하세요. (for문 사용)

//int main()
//{
//	int i;
//	for (int i = 1; i <= 10; i++)
//	{
//		if (i % 2 == 0)
//		{
//			printf("%d\n", i);
//		}
//	}
//}

// 다음은 2차원 배열과 관련된 문제이다.

// 크기가 3 x 3 인 2차원 배열을 선언하고, 사용자로부터 9개의 정수 값을 입력받아 
// 배열에 저장한 뒤, 배열에 저장된 값들을 출력하는 프로그램을 작성하세요.

// 예시 :

// 정수 9개를 입력하세요.

// 1 2 3
// 4 5 6
// 7 8 9

// 배열에 저장된 값:
// 1 2 3
// 4 5 6
// 7 8 9
//#include <stdio.h>
//int main()
//{
//	int arr[3][3];
//	// 9개의 정수 값을 받아 배열에 저장
//	for (int i = 0; i < 3; i++)
//	{
//		printf("정수를 3개 입력해 주세요 >>> ");
//		for (int j = 0; j < 3; j++)
//		{
//			
//			scanf_s("%d", &arr[i][j]);
//		}
//	}
//
//	// 출력
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 3; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//}

// 문제2
// Chat gpt 를 이용하여 계산기 프로그램을 만듭니다.
// + ,- , *, / 만 만들도록 
// 작성이 잘 되서 잘 동작할 경우, 혹은 되지않을 시 문제를 해결하고 주석처를 해 둔다.
// 계산기 프로그램 안에 있는 코드들에게 주석처리를 해 가며 설명을 해 놓는다.

